## Combining lists and tuples with +

In [2]:
orders_2021_08_04 = [
 (9423517, '2021-08-04', 9001),
 (4626232, '2021-08-04', 9003),
 (9423534, '2021-08-04', 9001)
]
orders_2021_08_05 = [
 (9423679, '2021-08-05', 9002),
 (4626377, '2021-08-05', 9003),
 (4626412, '2021-08-05', 9004)
]
orders_2021_08_06 = [
 (9423783, '2021-08-06', 9002),
 (4626490, '2021-08-06', 9004)
]

In [3]:
 orders = orders_2021_08_04 + orders_2021_08_05 + orders_2021_08_06

In [4]:
orders

[(9423517, '2021-08-04', 9001),
 (4626232, '2021-08-04', 9003),
 (9423534, '2021-08-04', 9001),
 (9423679, '2021-08-05', 9002),
 (4626377, '2021-08-05', 9003),
 (4626412, '2021-08-05', 9004),
 (9423783, '2021-08-06', 9002),
 (4626490, '2021-08-06', 9004)]

## Combining Dictionaries with **

In [5]:
extrafields_9423517 = {
    'ShippingInstructions' : { 'name' : 'John Silver',
                               'Phone': [{'type':'Office', 'number':'809-123-9309'},
                                         {'type':'Mobile', 'number':'417-123-4567'}]}
}

order_9423517 = {'OrderNo':9423517, 'Date':'2022-02-04', 'Empno':9001}

In [6]:
order_9423517 = {**order_9423517, **extrafields_9423517}

In [7]:
order_9423517

{'OrderNo': 9423517,
 'Date': '2022-02-04',
 'Empno': 9001,
 'ShippingInstructions': {'name': 'John Silver',
  'Phone': [{'type': 'Office', 'number': '809-123-9309'},
   {'type': 'Mobile', 'number': '417-123-4567'}]}}

## Combining Corresponding Rows to Two Structures

In [8]:
details = [
 (9423517, 'Jeans', 'Rip Curl', 87.0, 1),
 (9423517, 'Jacket', 'The North Face', 112.0, 1),
 (4626232, 'Socks', 'Vans', 15.0, 1),
 (4626232, 'Jeans', 'Quiksilver', 82.0, 1),
 (9423534, 'Socks', 'DC', 10.0, 2),
 (9423534, 'Socks', 'Quiksilver', 12.0, 2),
 (9423679, 'T-shirt', 'Patagonia', 35.0, 1),
 (4626377, 'Hoody', 'Animal', 44.0, 1),
 (4626377, 'Cargo Shorts', 'Animal', 38.0, 1),
 (4626412, 'Shirt', 'Volcom', 78.0, 1),
 (9423783, 'Boxer Shorts', 'Superdry', 30.0, 2),
 (9423783, 'Shorts', 'Globe', 26.0, 1),
 (4626490, 'Cargo Shorts', 'Billabong', 54.0, 1),
 (4626490, 'Sweater', 'Dickies', 56.0, 1)
]

In [2]:
orders2 = [
 (9423517, '2021-08-04', 9001),
 (4626232, '2021-08-04', 9003)]
details2 = [
 (9423517, 'Jeans', 'Rip Curl', 87.0, 1),
 (9423517, 'Jacket', 'The North Face', 112.0, 1),
 (4626232, 'Socks', 'Vans', 15.0, 1),
 (4626232, 'Jeans', 'Quiksilver', 82.0, 1)]
order_details2 = []
for o in orders2:
    for d in details2:
        if d[0] == o[0]:
            order_details2.append(o + d[1:])

In [3]:
order_details2

[(9423517, '2021-08-04', 9001, 'Jeans', 'Rip Curl', 87.0, 1),
 (9423517, '2021-08-04', 9001, 'Jacket', 'The North Face', 112.0, 1),
 (4626232, '2021-08-04', 9003, 'Socks', 'Vans', 15.0, 1),
 (4626232, '2021-08-04', 9003, 'Jeans', 'Quiksilver', 82.0, 1)]

In [9]:
order_details = []
for o in orders:
    for d in details:
        if d[0] == o[0]:
            order_details.append(o + d[1:])

In [13]:
order_details

[(9423517, '2021-08-04', 9001, 'Jeans', 'Rip Curl', 87.0, 1),
 (9423517, '2021-08-04', 9001, 'Jacket', 'The North Face', 112.0, 1),
 (4626232, '2021-08-04', 9003, 'Socks', 'Vans', 15.0, 1),
 (4626232, '2021-08-04', 9003, 'Jeans', 'Quiksilver', 82.0, 1),
 (9423534, '2021-08-04', 9001, 'Socks', 'DC', 10.0, 2),
 (9423534, '2021-08-04', 9001, 'Socks', 'Quiksilver', 12.0, 2),
 (9423679, '2021-08-05', 9002, 'T-shirt', 'Patagonia', 35.0, 1),
 (4626377, '2021-08-05', 9003, 'Hoody', 'Animal', 44.0, 1),
 (4626377, '2021-08-05', 9003, 'Cargo Shorts', 'Animal', 38.0, 1),
 (4626412, '2021-08-05', 9004, 'Shirt', 'Volcom', 78.0, 1),
 (9423783, '2021-08-06', 9002, 'Boxer Shorts', 'Superdry', 30.0, 2),
 (9423783, '2021-08-06', 9002, 'Shorts', 'Globe', 26.0, 1),
 (4626490, '2021-08-06', 9004, 'Cargo Shorts', 'Billabong', 54.0, 1),
 (4626490, '2021-08-06', 9004, 'Sweater', 'Dickies', 56.0, 1)]

In [11]:
order_details2 = [[o for o in orders if d[0] == o[0]][0] + d[1:] for d in details]

In [12]:
order_details2

[(9423517, '2021-08-04', 9001, 'Jeans', 'Rip Curl', 87.0, 1),
 (9423517, '2021-08-04', 9001, 'Jacket', 'The North Face', 112.0, 1),
 (4626232, '2021-08-04', 9003, 'Socks', 'Vans', 15.0, 1),
 (4626232, '2021-08-04', 9003, 'Jeans', 'Quiksilver', 82.0, 1),
 (9423534, '2021-08-04', 9001, 'Socks', 'DC', 10.0, 2),
 (9423534, '2021-08-04', 9001, 'Socks', 'Quiksilver', 12.0, 2),
 (9423679, '2021-08-05', 9002, 'T-shirt', 'Patagonia', 35.0, 1),
 (4626377, '2021-08-05', 9003, 'Hoody', 'Animal', 44.0, 1),
 (4626377, '2021-08-05', 9003, 'Cargo Shorts', 'Animal', 38.0, 1),
 (4626412, '2021-08-05', 9004, 'Shirt', 'Volcom', 78.0, 1),
 (9423783, '2021-08-06', 9002, 'Boxer Shorts', 'Superdry', 30.0, 2),
 (9423783, '2021-08-06', 9002, 'Shorts', 'Globe', 26.0, 1),
 (4626490, '2021-08-06', 9004, 'Cargo Shorts', 'Billabong', 54.0, 1),
 (4626490, '2021-08-06', 9004, 'Sweater', 'Dickies', 56.0, 1)]

In [14]:
details.append((4626592, 'Shorts','Protest',48.0, 1))

In [15]:
order_details3 = [[o for o in orders if d[0]==o[0]][0] + d[1:] for d in details]

IndexError: list index out of range

In [17]:
# right join with 2 lists where 1 list has non matching records
order_details_right = [[o for o in orders if d[0] in o][0] + d[1:] if d[0] in [o[0] for o
                        in orders] else (d[0], None, None) + d[1:] for d in details]

In [18]:
order_details_right

[(9423517, '2021-08-04', 9001, 'Jeans', 'Rip Curl', 87.0, 1),
 (9423517, '2021-08-04', 9001, 'Jacket', 'The North Face', 112.0, 1),
 (4626232, '2021-08-04', 9003, 'Socks', 'Vans', 15.0, 1),
 (4626232, '2021-08-04', 9003, 'Jeans', 'Quiksilver', 82.0, 1),
 (9423534, '2021-08-04', 9001, 'Socks', 'DC', 10.0, 2),
 (9423534, '2021-08-04', 9001, 'Socks', 'Quiksilver', 12.0, 2),
 (9423679, '2021-08-05', 9002, 'T-shirt', 'Patagonia', 35.0, 1),
 (4626377, '2021-08-05', 9003, 'Hoody', 'Animal', 44.0, 1),
 (4626377, '2021-08-05', 9003, 'Cargo Shorts', 'Animal', 38.0, 1),
 (4626412, '2021-08-05', 9004, 'Shirt', 'Volcom', 78.0, 1),
 (9423783, '2021-08-06', 9002, 'Boxer Shorts', 'Superdry', 30.0, 2),
 (9423783, '2021-08-06', 9002, 'Shorts', 'Globe', 26.0, 1),
 (4626490, '2021-08-06', 9004, 'Cargo Shorts', 'Billabong', 54.0, 1),
 (4626490, '2021-08-06', 9004, 'Sweater', 'Dickies', 56.0, 1),
 (4626592, None, None, 'Shorts', 'Protest', 48.0, 1)]

In [20]:
# To sum up the price * quantity of the orders above
sum(pr*qt for _, _, _, _, _, pr, qt in order_details_right)

779.0

In [23]:
# To sum up only the matching racords between orders and order details
sum(pr*qt for _, dt, _, _, _, pr, qt in order_details_right if dt !=None)

731.0

## Concatenating NumPy Arrays

In [38]:
import numpy as np
jeff_salary = [2000,3000,3000]
nick_salary = [2600,2800,2800]
tom_salary = [2300, 2500, 2500]
base_salary1 = np.array([jeff_salary, nick_salary, tom_salary])

In [39]:
maya_salary = [2200,2400,2400]
john_salary = [2500,2700,2700]
base_salary2 = np.array([maya_salary, john_salary])

In [40]:
base_salary = np.concatenate((base_salary1, base_salary2), axis=0)

In [41]:
base_salary

array([[2000, 3000, 3000],
       [2600, 2800, 2800],
       [2300, 2500, 2500],
       [2200, 2400, 2400],
       [2500, 2700, 2700]])

In [42]:
new_month_salary = np.array([[3000],[2900],[2500],[2500],[2700]])

In [43]:
base_salary = np.concatenate((base_salary, new_month_salary), axis=1)

In [44]:
base_salary

array([[2000, 3000, 3000, 3000],
       [2600, 2800, 2800, 2900],
       [2300, 2500, 2500, 2500],
       [2200, 2400, 2400, 2500],
       [2500, 2700, 2700, 2700]])

## Concatenating DataFrames

In [45]:
import pandas as pd
salary_df1 = pd.DataFrame({
    "jeff":jeff_salary,
    "nick":nick_salary,
    "tom":tom_salary
})

In [46]:
salary_df1.index=['June','July','August']

In [47]:
salary_df1

        jeff  nick   tom
June    2000  2600  2300
July    3000  2800  2500
August  3000  2800  2500

In [48]:
salary_df1 = salary_df1.T

In [49]:
salary_df1

      June  July  August
jeff  2000  3000    3000
nick  2600  2800    2800
tom   2300  2500    2500

In [50]:
salary_df2 = pd.DataFrame(
    {"maya": maya_salary,
     "john":john_salary
        
    }, index=['June','July','August']).T

In [51]:
salary_df2

      June  July  August
maya  2200  2400    2400
john  2500  2700    2700

## Concatenation Along Axis 0

In [53]:
salary_df = pd.concat([salary_df1, salary_df2])

In [55]:
salary_df

      June  July  August
jeff  2000  3000    3000
nick  2600  2800    2800
tom   2300  2500    2500
maya  2200  2400    2400
john  2500  2700    2700

## Concatenation Along Axis 1

In [57]:
salary_df3 = pd.DataFrame(
    {'September':[3000,2800,2500,2400,2700],
     'October':[3200,3000,2700,2500,2900]},
    index=['jeff','nick','tom','maya','john'])

In [58]:
salary_df3

      September  October
jeff       3000     3200
nick       2800     3000
tom        2500     2700
maya       2400     2500
john       2700     2900

In [59]:
salary_df = pd.concat([salary_df, salary_df3],axis=1)

In [60]:
salary_df

      June  July  August  September  October
jeff  2000  3000    3000       3000     3200
nick  2600  2800    2800       2800     3000
tom   2300  2500    2500       2500     2700
maya  2200  2400    2400       2400     2500
john  2500  2700    2700       2700     2900

## Removing Columns/Rows from a dataframe

In [61]:
salary_df = salary_df.drop(['September','October'],axis=1)

In [62]:
salary_df = salary_df.drop(['nick','maya'],axis=0)

In [63]:
salary_df

      June  July  August
jeff  2000  3000    3000
tom   2300  2500    2500
john  2500  2700    2700

## Concatenating dataframes with hierarchical index

In [64]:
df_date_region1 = pd.DataFrame(
    [('2022-02-04','East',97.0),
     ('2022-02-04','West',243.0),
     ('2022-02-05','East',160.0),
     ('2022-02-05','West',35.0),
     ('2022-02-06','East',110.0),
     ('2022-02-06','West',86.0)],
    columns = ['Date','Region','Total']).set_index(['Date','Region'])

In [65]:
df_date_region1

                   Total
Date       Region
2022-02-04 East     97.0
           West    243.0
2022-02-05 East    160.0
           West     35.0
2022-02-06 East    110.0
           West     86.0

In [66]:
df_date_region2 = pd.DataFrame(
    [('2022-02-04','South',114.0),
     ('2022-02-05','South',325.0),
     ('2022-02-06','South',212.0)],
    columns=['Date','Region','Total']).set_index(['Date','Region'])

In [67]:
df_date_region2

                   Total
Date       Region
2022-02-04 South   114.0
2022-02-05 South   325.0
2022-02-06 South   212.0

In [71]:
# concatenate the 2 multi-index dataframes and sort by the index level
df_date_region = pd.concat([df_date_region1, df_date_region2]).sort_index(level=['Date','Region'])

In [72]:
df_date_region

                   Total
Date       Region
2022-02-04 East     97.0
           South   114.0
           West    243.0
2022-02-05 East    160.0
           South   325.0
           West     35.0
2022-02-06 East    110.0
           South   212.0
           West     86.0

## Implementing  a right join

In [73]:
import pandas as pd
df_orders = pd.DataFrame(orders, columns = ['OrderNo','Date','Empno'])
df_details = pd.DataFrame(details, columns = ['OrderNo','Item','Brand','Price','Quantity'])

In [75]:
df_orders_details_right = df_orders.merge(df_details, how='right',
                                         left_on='OrderNo', right_on='OrderNo')

In [76]:
df_orders_details_right

    OrderNo        Date   Empno          Item           Brand  Price  Quantity
0   9423517  2021-08-04  9001.0         Jeans        Rip Curl   87.0         1
1   9423517  2021-08-04  9001.0        Jacket  The North Face  112.0         1
2   4626232  2021-08-04  9003.0         Socks            Vans   15.0         1
3   4626232  2021-08-04  9003.0         Jeans      Quiksilver   82.0         1
4   9423534  2021-08-04  9001.0         Socks              DC   10.0         2
5   9423534  2021-08-04  9001.0         Socks      Quiksilver   12.0         2
6   9423679  2021-08-05  9002.0       T-shirt       Patagonia   35.0         1
7   4626377  2021-08-05  9003.0         Hoody          Animal   44.0         1
8   4626377  2021-08-05  9003.0  Cargo Shorts          Animal   38.0         1
9   4626412  2021-08-05  9004.0         Shirt          Volcom   78.0         1
10  9423783  2021-08-06  9002.0  Boxer Shorts        Superdry   30.0         2
11  9423783  2021-08-06  9002.0        Shorts           Globe   26.0         1
12  4626490  2021-08-06  9004.0  Cargo Shorts       Billabong   54.0         1
13  4626490  2021-08-06  9004.0       Sweater         Dickies   56.0         1
14  4626592         NaN     NaN        Shorts         Protest   48.0         1

In [77]:
print(df_orders_details_right.dtypes)

OrderNo       int64
Date         object
Empno       float64
Item         object
Brand        object
Price       float64
Quantity      int64
dtype: object

In [78]:
df_orders_details_right.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   OrderNo   15 non-null     int64
 1   Date      14 non-null     object
 2   Empno     14 non-null     float64
 3   Item      15 non-null     object
 4   Brand     15 non-null     object
 5   Price     15 non-null     float64
 6   Quantity  15 non-null     int64
dtypes: float64(2), int64(2), object(3)
memory usage: 972.0+ bytes

In [79]:
df_orders_details_right = df_orders_details_right.fillna({'Empno':0}).astype({'Empno':'int64'})

In [81]:
df_orders_details_right

    OrderNo        Date  Empno          Item           Brand  Price  Quantity
0   9423517  2021-08-04   9001         Jeans        Rip Curl   87.0         1
1   9423517  2021-08-04   9001        Jacket  The North Face  112.0         1
2   4626232  2021-08-04   9003         Socks            Vans   15.0         1
3   4626232  2021-08-04   9003         Jeans      Quiksilver   82.0         1
4   9423534  2021-08-04   9001         Socks              DC   10.0         2
5   9423534  2021-08-04   9001         Socks      Quiksilver   12.0         2
6   9423679  2021-08-05   9002       T-shirt       Patagonia   35.0         1
7   4626377  2021-08-05   9003         Hoody          Animal   44.0         1
8   4626377  2021-08-05   9003  Cargo Shorts          Animal   38.0         1
9   4626412  2021-08-05   9004         Shirt          Volcom   78.0         1
10  9423783  2021-08-06   9002  Boxer Shorts        Superdry   30.0         2
11  9423783  2021-08-06   9002        Shorts           Globe   26.0         1
12  4626490  2021-08-06   9004  Cargo Shorts       Billabong   54.0         1
13  4626490  2021-08-06   9004       Sweater         Dickies   56.0         1
14  4626592         NaN      0        Shorts         Protest   48.0         1

In [82]:
df_orders_details_right.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   OrderNo   15 non-null     int64
 1   Date      14 non-null     object
 2   Empno     15 non-null     int64
 3   Item      15 non-null     object
 4   Brand     15 non-null     object
 5   Price     15 non-null     float64
 6   Quantity  15 non-null     int64
dtypes: float64(1), int64(3), object(3)
memory usage: 972.0+ bytes

## Implementing a many-to-many join

In [83]:
import pandas as pd

In [84]:
books = pd.DataFrame({'book_id':['b1','b2','b3'],
                      'title':['Beautiful Coding', 'Python for Web Development','Pythonic Thinking'],
                      'topic':['programming','Python, Web','Python']
                     })
authors = pd.DataFrame({'author_id':['jsn','tri','wsn'],
                        'author':['Johnson','Treloni','Willson']
                       })

In [86]:
matching = pd.DataFrame({'author_id':['jsn','jsn','tri','wsn'],
                         'book_id':['b1','b2','b2','b3']
                        })

In [87]:
matching

  author_id book_id
0       jsn      b1
1       jsn      b2
2       tri      b2
3       wsn      b3

In [88]:
# merge the 2 dataframes together using the matching dataframe as an intermediary
authorship = books.merge(matching).merge(authors)[['title','topic','author']]

In [89]:
authorship

                        title        topic   author
0            Beautiful Coding  programming  Johnson
1  Python for Web Development  Python, Web  Johnson
2  Python for Web Development  Python, Web  Treloni
3           Pythonic Thinking       Python  Willson